In [29]:
import pandas as pd 
import numpy as np

Columns renaming

In [30]:
data = pd.read_csv('./data/mammals.csv')
data.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

In [31]:
#Fast and for all
data.columns = ['name', 'weight_body_kg', 'weight_brain_kg']
data.head()

              name  weight_body_kg  weight_brain_kg
0       Arctic fox           3.385             44.5
1       Owl monkey           0.480             15.5
2  Mountain beaver           1.350              8.1
3              Cow         465.000            423.0
4        Grey wolf          36.330            119.5

In [32]:
#For choosen columns
columns = {'weight_body_kg': 'weight_bodyKG', 'weight_brain_kg': 'weight_brainKG'}
data.rename(columns = columns, inplace=True)
data.head()

              name  weight_bodyKG  weight_brainKG
0       Arctic fox          3.385            44.5
1       Owl monkey          0.480            15.5
2  Mountain beaver          1.350             8.1
3              Cow        465.000           423.0
4        Grey wolf         36.330           119.5

In [33]:
data = pd.read_csv('./data/mammals.csv', index_col='name')
data.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5

In [34]:
#Chagne the value in index
data.rename(index= {'Cow': 'Land Cow'}, inplace=True)
data.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land Cow         465.000  423.0
Grey wolf         36.330  119.5

In [35]:
#Using a copy to change a value inside of dataframe. Use .loc
dataCopy = data.copy()
dataCopy.loc['Arctic fox', 'body'] = 5
dataCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         36.33  119.5

In [36]:
data.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land Cow         465.000  423.0
Grey wolf         36.330  119.5

In [37]:
#Example
profession = pd.read_csv('./data/Prestige.csv', index_col='name')
profession.head()

                     education  income  women  prestige  census  type
name
gov.administrators       13.11   12351  11.16      68.8    1113  prof
general.managers         12.26   25879   4.02      69.1    1130  prof
accountants              12.77    9271  15.70      63.4    1171  prof
purchasing.officers      11.42    8865   9.11      56.8    1175  prof
chemists                 14.62    8403  11.68      73.5    2111  prof

In [38]:
professionCopy = profession.copy()
professionCopy

                     education  income  women  prestige  census  type
name
gov.administrators       13.11   12351  11.16      68.8    1113  prof
general.managers         12.26   25879   4.02      69.1    1130  prof
accountants              12.77    9271  15.70      63.4    1171  prof
purchasing.officers      11.42    8865   9.11      56.8    1175  prof
chemists                 14.62    8403  11.68      73.5    2111  prof
...                        ...     ...    ...       ...     ...   ...
bus.drivers               7.58    5562   9.47      35.9    9171    bc
taxi.drivers              7.93    4224   3.59      25.1    9173    bc
longshoremen              8.37    4753   0.00      26.1    9313    bc
typesetters              10.00    6462  13.58      42.2    9511    bc
bookbinders               8.55    3617  70.87      35.2    9517    bc

[102 rows x 6 columns]

In [39]:
columns = {'women': 'womenPercent', 'prestige': 'prestigeIndicator'}
professionCopy.rename(columns=columns, inplace=True)
professionCopy.head()

,education,income,womenPercent,prestigeIndicator,census,type
name,,,,,,
gov.administrators,13.11,12351,11.16,68.8,1113,prof
general.managers,12.26,25879,4.02,69.1,1130,prof
accountants,12.77,9271,15.70,63.4,1171,prof
purchasing.officers,11.42,8865,9.11,56.8,1175,prof
chemists,14.62,8403,11.68,73.5,2111,prof

In [40]:
professionCopy.rename(index={'accountants': 'bookkeepers', 'general.managers': 'managers'}, inplace=True)
professionCopy.head()

,education,income,womenPercent,prestigeIndicator,census,type
name,,,,,,
gov.administrators,13.11,12351,11.16,68.8,1113,prof
managers,12.26,25879,4.02,69.1,1130,prof
bookkeepers,12.77,9271,15.70,63.4,1171,prof
purchasing.officers,11.42,8865,9.11,56.8,1175,prof
chemists,14.62,8403,11.68,73.5,2111,prof